In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
cars = os.path.join("..","electric_cars","vehicle-fuel-type-count-by-zip-code.csv")
geocodes_raw = os.path.join("..","electric_cars","fips_zip_x.csv")
cars_data = pd.read_csv(cars)
geocodes = pd.read_csv(geocodes_raw)
cars_data.head()

,Date,Zip Code,Model Year,Fuel,Make,Duty,Vehicles
0,10/1/2018,90000,2006,Gasoline,OTHER/UNK,Light,1
1,10/1/2018,90000,2014,Gasoline,OTHER/UNK,Light,1
2,10/1/2018,90000,2016,Gasoline,OTHER/UNK,Light,1
3,10/1/2018,90000,2017,Gasoline,OTHER/UNK,Light,1
4,10/1/2018,90000,<2006,Diesel and Diesel Hybrid,OTHER/UNK,Heavy,55

In [3]:
cars_data['Vehicles'].sum()

30411713

In [4]:
geocodes.dtypes
#geocodes["Zip Code"].astype(str)

Unnamed: 0    int64
ZCTA5         int64
STATE         int64
COUNTY        int64
dtype: object

In [5]:
geocodes.head()

   Unnamed: 0  ZCTA5  STATE  COUNTY
0       40738  89010      6      51
1       40748  89019      6      27
2       40749  89019      6      71
3       40774  89060      6      27
4       40776  89061      6      27

In [6]:
#num_schools=school_data_complete["school_name"].nunique()
cars_description = cars_data["Fuel"].unique()
print(cars_description)

['Gasoline' 'Diesel and Diesel Hybrid' 'Battery Electric' 'Other'
 'Flex-Fuel' 'Hybrid Gasoline' 'Natural Gas' 'Plug-in Hybrid'
 'Hydrogen Fuel Cell']

In [7]:
geocodes =geocodes.rename(columns={"ZCTA5":"Zip Code"})
cars_data =cars_data.rename(columns={'Zip Code': 'Zip Code'})

In [8]:
cars_merge_county = pd.merge(cars_data, geocodes, how="inner", on=["Zip Code"])

In [12]:
cars_merge_county
cars = cars_merge_county.dropna()
cars.head()

,Date,Zip Code,Model Year,Fuel,Make,Duty,Vehicles,Unnamed: 0,STATE,COUNTY
0,10/1/2018,90001,2006,Diesel and Diesel Hybrid,FORD,Heavy,16,40937,6,37
1,10/1/2018,90001,2006,Diesel and Diesel Hybrid,OTHER/UNK,Heavy,23,40937,6,37
2,10/1/2018,90001,2006,Diesel and Diesel Hybrid,OTHER/UNK,Light,9,40937,6,37
3,10/1/2018,90001,2006,Battery Electric,OTHER/UNK,Light,1,40937,6,37
4,10/1/2018,90001,2006,Flex-Fuel,CHEVROLET,Light,41,40937,6,37

In [37]:
cars_cleaned = cars.drop(columns=['Date', 'Model Year', 'Make', 'Duty', 'Unnamed: 0', 'STATE', 'Zip Code'])
cars_cleaned.head()

                       Fuel  Vehicles  COUNTY
0  Diesel and Diesel Hybrid        16      37
1  Diesel and Diesel Hybrid        23      37
2  Diesel and Diesel Hybrid         9      37
3          Battery Electric         1      37
4                 Flex-Fuel        41      37

In [52]:
battery_electric = cars_cleaned[cars_cleaned['Fuel']=="Battery Electric"]
plug_in = cars_cleaned[cars_cleaned['Fuel']=="Plug-in Hybrid"]
hybrid = cars_cleaned[cars_cleaned['Fuel']=='Hybrid Gasoline']
batt_car_total = battery_electric['Vehicles'].sum()
t_hybrid=hybrid['Vehicles'].sum()
plug_in_total = plug_in['Vehicles'].sum()
print(t_hybrid)
#cars['Vehicles'].sum()

1118539

In [39]:
counties = cars_cleaned["COUNTY"].unique()
print(counties)

[ 37 111  59  71  65  73  25  27  83  31 107  29  19  53  69  79  51  39
  43  47  81  85  75   1  55  13  95  97  67  41  87  77   9   3 109  99
  45  33  23 105  15  93   5  57  61 113  17 101  11 115   7  91  63  21
 103  89  35  49]

In [10]:
cars['Vehicles'].sum()

32288952

In [11]:
#cars data has 584338 observations
#after merge there are 590123
#there are an additional .98% observations

len(cars_data)

584338